app/views/gossips/index.html.erb

<p>Voici la liste des rumeurs:</p>
<% if User.find_by(id: session[:user_id]) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

<div id="conteneur_card">
  <% Gossip.all.each.with_index do |gossip, index| %>
---
SELECT "gossips".* FROM "gossips"

      <h5 class="card-title">Titre: <%= gossip.title %></h5>
      <p class="card-text">Auteur: <%= gossip.user.first_name %></p>
      <p class="card-text">Commentaires: <%= Comment.where(gossip_id: gossip.id).count %></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 1]]

        <%= link_to "Voir l'auteur", user_path(gossip.user_id), class: "card-link" %>
        <% if User.find_by(id: session[:user_id]) && gossip.user_id == User.find_by(id: session[:user_id]).id %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]