app/controllers/gossips_controller.rb

  def create
    @gossip = Gossip.new(title: params[:title], content: params[:content], user_id: session[:user_id])
    if @gossip.save
---
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "cd"], ["content", "cdqa"], ["user_id", 1], ["created_at", "2019-02-07 17:57:09.832913"], ["updated_at", "2019-02-07 17:57:09.832913"]]