app/controllers/users_controller.rb

  def create
    if params[:password] == params[:password_confirmation]
      @user = User.new(first_name: params[:first_name], last_name: params[:last_name], description: params[:description], password: params[:password], email: params[:email], age: params[:age], city_id: City.all.sample.id)
      if @user.save
---
SELECT "cities".* FROM "cities"
INSERT INTO "users" ("first_name", "last_name", "description", "email", "age", "city_id", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"