app/views/cities/show.html.erb

<h1>Voici les rumeurs de la ville de <%= City.find(params[:id]).name %></h1>
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]

<div id="conteneur_card">
  <% Gossip.all.each.with_index do |gossip, index| %>
  <% if gossip.user.city.name == City.find(params[:id]).name %>
---
SELECT "gossips".* FROM "gossips"
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]